// ### Вопросы
//
// - Что такое деструктуризация объектов и массивов?
// Это когда мы можем упростить обьявление переменных к массивав или обьектам
//   - Можно ли деструктуризировать опциональное поле?
//можно использовать деструктуризация для опционального поля, но для этого нужно задать значение
// по умолчанию, так как если этого поля нет, то замени значением по умолчанию, также нужно
// использовать переименование
//   - Как использовать деструктуризацию со значением по умолчанию?
//соответственно, используем деструктуризацию с переменованием и присвоим ему значение по умолч.
//   - В чем разница использования оператора `...` слева и справа от знака равно?
// справа оператор '...' убирает все значения ДО, оператор слева '...' добавляет все значения слева,
// но к нему справа можно добавить и другие переменные
